# Brewfile — declarative list of Homebrew packages for this setup.
# Apply with `brew bundle` (installs what's missing, skips what's present).
# Heavy apps (Docker, Android Studio, etc.) are intentionally left out — install those manually.

# ---------- Taps ----------
tap "nikitabobko/tap"   # aerospace
tap "leoafarias/fvm"    # flutter version manager

# ---------- CLI tools ----------
brew "stow"        # symlink manager for these dotfiles
brew "eza"         # ls replacement
brew "bat"         # cat replacement
brew "fzf"         # fuzzy finder
brew "atuin"       # shell history
brew "starship"    # prompt
brew "git-delta"   # git diff pager
brew "zoxide"      # smarter cd
brew "rbenv"       # ruby version manager
brew "tmux"        # terminal multiplexer
brew "jq"          # JSON processor (used by the Claude statusline)
brew "fvm"         # flutter version manager

# ---------- Terminal & window management ----------
cask "ghostty"
cask "aerospace"
cask "karabiner-elements"

# ---------- Editors ----------
cask "visual-studio-code"
cask "cursor"

# ---------- Fonts ----------
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
