aaron-bond.better-comments
batisteo.vscode-django
bpruitt-goddard.mermaid-markdown-syntax-highlighting
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
codeium.codeium
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
denoland.vscode-deno
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
eamodio.gitlens
equimper.react-native-react-redux
esbenp.prettier-vscode
expo.vscode-expo-tools
formulahendry.auto-close-tag
fwcd.kotlin
george-alisson.html-preview-vscode
github.vscode-pull-request-github
golang.go
google.arb-editor
hzgood.dart-data-class-generator
kevinrose.vsc-python-indent
luanpotter.dart-import
maciejdems.add-to-gitignore
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
mermaidchart.vscode-mermaid-chart
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
msjsdiag.vscode-react-native
nash.awesome-flutter-snippets
naumovs.color-highlight
njpwerner.autodocstring
patbenatar.advanced-new-file
pflannery.vscode-versionlens
pkief.material-icon-theme
planbcoding.vscode-react-refactor
pomdtr.excalidraw-editor
redhat.vscode-yaml
repreng.csv
ritwickdey.liveserver
robert-brunhage.flutter-riverpod-snippets
streetsidesoftware.code-spell-checker
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
wholroyd.jinja
wix.vscode-import-cost
yoavbls.pretty-ts-errors
